Revit 2027 API
Railing.IsValidPathForRailing Method
 Checks whether a railing can be created along a railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidPathForRailing(
	CurveLoop curveLoop
)
Public Shared Function IsValidPathForRailing (
	curveLoop As CurveLoop
) As Boolean
public:
static bool IsValidPathForRailing(
	CurveLoop^ curveLoop
)
static member IsValidPathForRailing :
        curveLoop : CurveLoop -> bool
Parameters
curveLoop CurveLoop
 The railing path along which the new railing will be created.
Return Value
Boolean
 True if the new railing path can be used in a railing definition, False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The railing path should be located on the same horizontal plane and it should contain lines or arcs only. It also has to be continuous and its three or more curves cannot meet in one end point.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace